RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_spi.c
    switch (frameSize) {
        case 0:

            tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

            /* Fill tx fifo with 0 */
            for (rxLen = 0; rxLen < tmpVal; rxLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive data and send the rest of the data 0 */
            for (rxLen = 0; rxLen < length - tmpVal; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint8_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive the rest of the data */
            for (; rxLen < length; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint8_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 1:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 2) ? length : (SPI_TX_FIFO_SIZE / 2);

            /* Fill tx fifo with 0 */
            for (rxLen = 0; rxLen < tmpVal; rxLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive data and send the rest of the data 0 */
            for (rxLen = 0; rxLen < length - tmpVal; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint16_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive the rest of the data */
            for (; rxLen < length; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint16_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 2:

        /* Same as case 3 */
        case 3:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 4) ? length : (SPI_TX_FIFO_SIZE / 4);

            /* Fill tx fifo with 0 */
            for (rxLen = 0; rxLen < tmpVal; rxLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive data and send the rest of the data 0 */
            for (rxLen = 0; rxLen < length - tmpVal; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint32_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
            }

            /* Wait receive the rest of the data */
            for (; rxLen < length; rxLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint32_t *)buff)[rxLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        default:
            break;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI send and receive datas at the same time
 *
 * @param  spiNo: SPI ID type
 * @param  sendBuff: Buffer of datas to send
 * @param  recvBuff: Buffer of datas received
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_SendRecvData(SPI_ID_Type spiNo, void *sendBuff, void *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t txLen = 0;
    uint32_t frameSize = 0;
    uint32_t SPIx = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE);

    switch (frameSize) {
        case 0:

            tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint8_t *)sendBuff)[txLen]);
            }

