RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_spi.c
            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint8_t *)recvBuff)[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint8_t *)sendBuff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint8_t *)recvBuff)[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 1:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 2) ? length : (SPI_TX_FIFO_SIZE / 2);

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint16_t *)sendBuff)[txLen]);
            }

            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint16_t *)recvBuff)[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint16_t *)sendBuff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint16_t *)recvBuff)[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 2:

        /* Same as case 3 */
        case 3:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 4) ? length : (SPI_TX_FIFO_SIZE / 4);

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint32_t *)sendBuff)[txLen]);
            }

            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint32_t *)recvBuff)[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint32_t *)sendBuff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                ((uint32_t *)recvBuff)[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        default:
            break;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get tx fifo available count value function
 *
 * @param  spiNo: SPI ID type
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t SPI_GetTxFifoCount(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get count value */
    return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_TX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get rx fifo available count value function
 *
 * @param  spiNo: SPI ID type
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t SPI_GetRxFifoCount(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get count value */
    return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get spi interrupt status
 *
 * @param  spiNo: SPI ID type
 * @param  intType: SPI interrupt type
 *
 * @return Status of interrupt
 *
*******************************************************************************/
BL_Sts_Type SPI_GetIntStatus(SPI_ID_Type spiNo, SPI_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_INT_TYPE(intType));

    /* Get certain or all interrupt status */
    tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);

    if (SPI_INT_ALL == intType) {
        if ((tmpVal & 0x3f) != 0) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        if ((tmpVal & (1U << intType)) != 0) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Get indicator of spi bus busy
 *
 * @param  spiNo: SPI ID type
 *
 * @return Status of spi bus
 *
*******************************************************************************/
BL_Sts_Type SPI_GetBusyStatus(SPI_ID_Type spiNo)
{
    uint32_t tmpVal;
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get bus busy status */
    tmpVal = BL_RD_REG(SPIx, SPI_BUS_BUSY);

